NordicSemiconductor/nrfx/mdk/nrf54h20_enga_interim.h
/*

Copyright (c) 2010 - 2023, Nordic Semiconductor ASA All rights reserved.

SPDX-License-Identifier: BSD-3-Clause

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

2. Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the distribution.

3. Neither the name of Nordic Semiconductor ASA nor the names of its
   contributors may be used to endorse or promote products derived from this
   software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
IMPLIED WARRANTIES OF MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE
ARE DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
POSSIBILITY OF SUCH DAMAGE.

*/

#ifndef NRF54H20_ENGA_INTERIM_H__
#define NRF54H20_ENGA_INTERIM_H__

#include "haltium_interim.h"

#if defined(NRF54H20_ENGA_XXAA)

    #if defined(NRF_TRUSTZONE_NONSECURE)
        #if defined(NRF_APPLICATION)
            #define GRTC_IRQ_GROUP 2
            #define GPIOTE_IRQ_GROUP 2
        #elif defined(NRF_RADIOCORE)
            #define GRTC_IRQ_GROUP 4
            #define GPIOTE_IRQ_GROUP 4
        #else
            #error Unknown core.
        #endif
    #elif defined(NRF_PPR) || defined(NRF_FLPR)
        #define GRTC_IRQ_GROUP 2
        #define GPIOTE_IRQ_GROUP 2
    #else
        #if defined(NRF_APPLICATION)
            #define GRTC_IRQ_GROUP 3
            #define GPIOTE_IRQ_GROUP 3
        #elif defined(NRF_RADIOCORE)
            #define GRTC_IRQ_GROUP 5
            #define GPIOTE_IRQ_GROUP 5
        #else
            #error Unknown core.
        #endif
    #endif

    #define EASYVDMA_PRESENT
    #define VDMADESCRIPTOR_CONFIG_CNT_Pos (0UL)        /*!< Position of CNT field.                                               */
    #define VDMADESCRIPTOR_CONFIG_CNT_Msk (0xFFFFFFUL << VDMADESCRIPTOR_CONFIG_CNT_Pos) /*!< Bit mask of CNT field.              */
    #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Pos (24UL) /*!< Position of ATTRIBUTE field.                                         */

    #define SPIS120_EASYDMA_MAXCNT_SIZE 16
    #define SPIS130_EASYDMA_MAXCNT_SIZE 16
    #define SPIS131_EASYDMA_MAXCNT_SIZE 16
    #define SPIS132_EASYDMA_MAXCNT_SIZE 16
    #define SPIS133_EASYDMA_MAXCNT_SIZE 16
    #define SPIS134_EASYDMA_MAXCNT_SIZE 16
    #define SPIS135_EASYDMA_MAXCNT_SIZE 16
    #define SPIS136_EASYDMA_MAXCNT_SIZE 16
    #define SPIS137_EASYDMA_MAXCNT_SIZE 16

    #define TWIM130_EASYDMA_MAXCNT_SIZE 16
    #define TWIM131_EASYDMA_MAXCNT_SIZE 16
    #define TWIM132_EASYDMA_MAXCNT_SIZE 16
    #define TWIM133_EASYDMA_MAXCNT_SIZE 16
    #define TWIM134_EASYDMA_MAXCNT_SIZE 16
    #define TWIM135_EASYDMA_MAXCNT_SIZE 16
    #define TWIM136_EASYDMA_MAXCNT_SIZE 16
    #define TWIM137_EASYDMA_MAXCNT_SIZE 16
            
    #define TWIS130_EASYDMA_MAXCNT_SIZE 16
    #define TWIS131_EASYDMA_MAXCNT_SIZE 16
    #define TWIS132_EASYDMA_MAXCNT_SIZE 16
    #define TWIS133_EASYDMA_MAXCNT_SIZE 16
    #define TWIS134_EASYDMA_MAXCNT_SIZE 16
    #define TWIS135_EASYDMA_MAXCNT_SIZE 16
    #define TWIS136_EASYDMA_MAXCNT_SIZE 16
    #define TWIS137_EASYDMA_MAXCNT_SIZE 16

    #define SPIM120_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                  */
    #define SPIM120_MAX_DATARATE 32                      /*!< (unspecified)                                                        */
    #define SPIM120_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
    #define SPIM120_EASYDMA_MAXCNT_MAX 14                /*!< (unspecified)                                                        */
    #define SPIM120_EASYDMA_MAXCNT_SIZE 15               /*!< (unspecified)                                                        */
    #define SPIM120_FEATURE_HARDWARE_CSN_PRESENT 1       /*!< (unspecified)                                                        */
    #define SPIM120_FEATURE_HARDWARE_DCX_PRESENT 1       /*!< (unspecified)                                                        */
    #define SPIM120_FEATURE_RXDELAY_PRESENT 1            /*!< (unspecified)                                                        */
    #define SPIM120_STALL_STATUS_PRESENT 1               /*!< (unspecified)                                                        */
    #define SPIM120_STALL_STATUS_TX_PRESENT 1            /*!< (unspecified)                                                        */
    #define SPIM120_NUM_CHIPSELECT_MIN 0                 /*!< (unspecified)                                                        */
    #define SPIM120_NUM_CHIPSELECT_MAX 0                 /*!< (unspecified)                                                        */
    #define SPIM120_NUM_CHIPSELECT_SIZE 1                /*!< (unspecified)                                                        */
    #define SPIM120_CORE_FREQUENCY 320                   /*!< Peripheral core frequency is 320 MHz.                                */
    #define SPIM120_PRESCALER_PRESENT 1                  /*!< (unspecified)                                                        */
    #define SPIM120_PRESCALER_DIVISOR_RANGE_MIN 4        /*!< (unspecified)                                                        */
    #define SPIM120_PRESCALER_DIVISOR_RANGE_MAX 126      /*!< (unspecified)                                                        */
    #define SPIM120_PRESCALER_DIVISOR_RANGE_SIZE 127     /*!< (unspecified)                                                        */
    #define SPIM120_RXDELAY_VALUE_RANGE_MIN 0            /*!< (unspecified)                                                        */
    #define SPIM120_RXDELAY_VALUE_RANGE_MAX 7            /*!< (unspecified)                                                        */
    #define SPIM120_RXDELAY_VALUE_RANGE_SIZE 8           /*!< (unspecified)                                                        */
    #define SPIM120_RXDELAY_RESET_VALUE 2                /*!< (unspecified)                                                        */
    #define SPIM120_RXDELAY_FIELD_WIDTH_MIN 0            /*!< (unspecified)                                                        */
    #define SPIM120_RXDELAY_FIELD_WIDTH_MAX 2            /*!< (unspecified)                                                        */
    #define SPIM120_RXDELAY_FIELD_WIDTH_SIZE 3           /*!< (unspecified)                                                        */

