NordicSemiconductor/nrfx/mdk/nrf54h20_enga_interim.h
    #define SPIM121_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                  */
    #define SPIM121_MAX_DATARATE 32                      /*!< (unspecified)                                                        */
    #define SPIM121_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
    #define SPIM121_EASYDMA_MAXCNT_MAX 14                /*!< (unspecified)                                                        */
    #define SPIM121_EASYDMA_MAXCNT_SIZE 15               /*!< (unspecified)                                                        */
    #define SPIM121_FEATURE_HARDWARE_CSN_PRESENT 1       /*!< (unspecified)                                                        */
    #define SPIM121_FEATURE_HARDWARE_DCX_PRESENT 1       /*!< (unspecified)                                                        */
    #define SPIM121_FEATURE_RXDELAY_PRESENT 1            /*!< (unspecified)                                                        */
    #define SPIM121_STALL_STATUS_PRESENT 1               /*!< (unspecified)                                                        */
    #define SPIM121_STALL_STATUS_TX_PRESENT 1            /*!< (unspecified)                                                        */
    #define SPIM121_NUM_CHIPSELECT_MIN 0                 /*!< (unspecified)                                                        */
    #define SPIM121_NUM_CHIPSELECT_MAX 0                 /*!< (unspecified)                                                        */
    #define SPIM121_NUM_CHIPSELECT_SIZE 1                /*!< (unspecified)                                                        */
    #define SPIM121_CORE_FREQUENCY 320                   /*!< Peripheral core frequency is 320 MHz.                                */
    #define SPIM121_PRESCALER_PRESENT 1                  /*!< (unspecified)                                                        */
    #define SPIM121_PRESCALER_DIVISOR_RANGE_MIN 4        /*!< (unspecified)                                                        */
    #define SPIM121_PRESCALER_DIVISOR_RANGE_MAX 126      /*!< (unspecified)                                                        */
    #define SPIM121_PRESCALER_DIVISOR_RANGE_SIZE 127     /*!< (unspecified)                                                        */
    #define SPIM121_RXDELAY_VALUE_RANGE_MIN 0            /*!< (unspecified)                                                        */
    #define SPIM121_RXDELAY_VALUE_RANGE_MAX 7            /*!< (unspecified)                                                        */
    #define SPIM121_RXDELAY_VALUE_RANGE_SIZE 8           /*!< (unspecified)                                                        */
    #define SPIM121_RXDELAY_RESET_VALUE 2                /*!< (unspecified)                                                        */
    #define SPIM121_RXDELAY_FIELD_WIDTH_MIN 0            /*!< (unspecified)                                                        */
    #define SPIM121_RXDELAY_FIELD_WIDTH_MAX 2            /*!< (unspecified)                                                        */
    #define SPIM121_RXDELAY_FIELD_WIDTH_SIZE 3           /*!< (unspecified)                                                        */

    #define SPIM130_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                  */
    #define SPIM130_MAX_DATARATE 8                       /*!< (unspecified)                                                        */
    #define SPIM130_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
    #define SPIM130_EASYDMA_MAXCNT_MAX 14                /*!< (unspecified)                                                        */
    #define SPIM130_EASYDMA_MAXCNT_SIZE 15               /*!< (unspecified)                                                        */
    #define SPIM130_FEATURE_HARDWARE_CSN_PRESENT 1       /*!< (unspecified)                                                        */
    #define SPIM130_FEATURE_HARDWARE_DCX_PRESENT 1       /*!< (unspecified)                                                        */
    #define SPIM130_FEATURE_RXDELAY_PRESENT 1            /*!< (unspecified)                                                        */
    #define SPIM130_STALL_STATUS_PRESENT 1               /*!< (unspecified)                                                        */
    #define SPIM130_STALL_STATUS_TX_PRESENT 1            /*!< (unspecified)                                                        */
    #define SPIM130_NUM_CHIPSELECT_MIN 0                 /*!< (unspecified)                                                        */
    #define SPIM130_NUM_CHIPSELECT_MAX 0                 /*!< (unspecified)                                                        */
    #define SPIM130_NUM_CHIPSELECT_SIZE 1                /*!< (unspecified)                                                        */
    #define SPIM130_CORE_FREQUENCY 16                    /*!< Peripheral core frequency is 16 MHz.                                 */
    #define SPIM130_PRESCALER_PRESENT 1                  /*!< (unspecified)                                                        */
    #define SPIM130_PRESCALER_DIVISOR_RANGE_MIN 2        /*!< (unspecified)                                                        */
    #define SPIM130_PRESCALER_DIVISOR_RANGE_MAX 126      /*!< (unspecified)                                                        */
    #define SPIM130_PRESCALER_DIVISOR_RANGE_SIZE 127     /*!< (unspecified)                                                        */
    #define SPIM130_RXDELAY_VALUE_RANGE_MIN 0            /*!< (unspecified)                                                        */
    #define SPIM130_RXDELAY_VALUE_RANGE_MAX 7            /*!< (unspecified)                                                        */
    #define SPIM130_RXDELAY_VALUE_RANGE_SIZE 8           /*!< (unspecified)                                                        */
    #define SPIM130_RXDELAY_RESET_VALUE 2                /*!< (unspecified)                                                        */
    #define SPIM130_RXDELAY_FIELD_WIDTH_MIN 0            /*!< (unspecified)                                                        */
    #define SPIM130_RXDELAY_FIELD_WIDTH_MAX 2            /*!< (unspecified)                                                        */
    #define SPIM130_RXDELAY_FIELD_WIDTH_SIZE 3           /*!< (unspecified)                                                        */

