NordicSemiconductor/nrfx/mdk/nrf54h20_enga_interim.h
    #define SPIM131_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                  */
    #define SPIM131_MAX_DATARATE 8                       /*!< (unspecified)                                                        */
    #define SPIM131_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
    #define SPIM131_EASYDMA_MAXCNT_MAX 14                /*!< (unspecified)                                                        */
    #define SPIM131_EASYDMA_MAXCNT_SIZE 15               /*!< (unspecified)                                                        */
    #define SPIM131_FEATURE_HARDWARE_CSN_PRESENT 1       /*!< (unspecified)                                                        */
    #define SPIM131_FEATURE_HARDWARE_DCX_PRESENT 1       /*!< (unspecified)                                                        */
    #define SPIM131_FEATURE_RXDELAY_PRESENT 1            /*!< (unspecified)                                                        */
    #define SPIM131_STALL_STATUS_PRESENT 1               /*!< (unspecified)                                                        */
    #define SPIM131_STALL_STATUS_TX_PRESENT 1            /*!< (unspecified)                                                        */
    #define SPIM131_NUM_CHIPSELECT_MIN 0                 /*!< (unspecified)                                                        */
    #define SPIM131_NUM_CHIPSELECT_MAX 0                 /*!< (unspecified)                                                        */
    #define SPIM131_NUM_CHIPSELECT_SIZE 1                /*!< (unspecified)                                                        */
    #define SPIM131_CORE_FREQUENCY 16                    /*!< Peripheral core frequency is 16 MHz.                                 */
    #define SPIM131_PRESCALER_PRESENT 1                  /*!< (unspecified)                                                        */
    #define SPIM131_PRESCALER_DIVISOR_RANGE_MIN 2        /*!< (unspecified)                                                        */
    #define SPIM131_PRESCALER_DIVISOR_RANGE_MAX 126      /*!< (unspecified)                                                        */
    #define SPIM131_PRESCALER_DIVISOR_RANGE_SIZE 127     /*!< (unspecified)                                                        */
    #define SPIM131_RXDELAY_VALUE_RANGE_MIN 0            /*!< (unspecified)                                                        */
    #define SPIM131_RXDELAY_VALUE_RANGE_MAX 7            /*!< (unspecified)                                                        */
    #define SPIM131_RXDELAY_VALUE_RANGE_SIZE 8           /*!< (unspecified)                                                        */
    #define SPIM131_RXDELAY_RESET_VALUE 2                /*!< (unspecified)                                                        */
    #define SPIM131_RXDELAY_FIELD_WIDTH_MIN 0            /*!< (unspecified)                                                        */
    #define SPIM131_RXDELAY_FIELD_WIDTH_MAX 2            /*!< (unspecified)                                                        */
    #define SPIM131_RXDELAY_FIELD_WIDTH_SIZE 3           /*!< (unspecified)                                                        */

    #define SPIM132_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                  */
    #define SPIM132_MAX_DATARATE 8                       /*!< (unspecified)                                                        */
    #define SPIM132_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
    #define SPIM132_EASYDMA_MAXCNT_MAX 14                /*!< (unspecified)                                                        */
    #define SPIM132_EASYDMA_MAXCNT_SIZE 15               /*!< (unspecified)                                                        */
    #define SPIM132_FEATURE_HARDWARE_CSN_PRESENT 1       /*!< (unspecified)                                                        */
    #define SPIM132_FEATURE_HARDWARE_DCX_PRESENT 1       /*!< (unspecified)                                                        */
    #define SPIM132_FEATURE_RXDELAY_PRESENT 1            /*!< (unspecified)                                                        */
    #define SPIM132_STALL_STATUS_PRESENT 1               /*!< (unspecified)                                                        */
    #define SPIM132_STALL_STATUS_TX_PRESENT 1            /*!< (unspecified)                                                        */
    #define SPIM132_NUM_CHIPSELECT_MIN 0                 /*!< (unspecified)                                                        */
    #define SPIM132_NUM_CHIPSELECT_MAX 0                 /*!< (unspecified)                                                        */
    #define SPIM132_NUM_CHIPSELECT_SIZE 1                /*!< (unspecified)                                                        */
    #define SPIM132_CORE_FREQUENCY 16                    /*!< Peripheral core frequency is 16 MHz.                                 */
    #define SPIM132_PRESCALER_PRESENT 1                  /*!< (unspecified)                                                        */
    #define SPIM132_PRESCALER_DIVISOR_RANGE_MIN 2        /*!< (unspecified)                                                        */
    #define SPIM132_PRESCALER_DIVISOR_RANGE_MAX 126      /*!< (unspecified)                                                        */
    #define SPIM132_PRESCALER_DIVISOR_RANGE_SIZE 127     /*!< (unspecified)                                                        */
    #define SPIM132_RXDELAY_VALUE_RANGE_MIN 0            /*!< (unspecified)                                                        */
    #define SPIM132_RXDELAY_VALUE_RANGE_MAX 7            /*!< (unspecified)                                                        */
    #define SPIM132_RXDELAY_VALUE_RANGE_SIZE 8           /*!< (unspecified)                                                        */
    #define SPIM132_RXDELAY_RESET_VALUE 2                /*!< (unspecified)                                                        */
    #define SPIM132_RXDELAY_FIELD_WIDTH_MIN 0            /*!< (unspecified)                                                        */
    #define SPIM132_RXDELAY_FIELD_WIDTH_MAX 2            /*!< (unspecified)                                                        */
    #define SPIM132_RXDELAY_FIELD_WIDTH_SIZE 3           /*!< (unspecified)                                                        */

    #define SPIM133_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                  */
    #define SPIM133_MAX_DATARATE 8                       /*!< (unspecified)                                                        */
    #define SPIM133_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
    #define SPIM133_EASYDMA_MAXCNT_MAX 14                /*!< (unspecified)                                                        */
    #define SPIM133_EASYDMA_MAXCNT_SIZE 15               /*!< (unspecified)                                                        */
    #define SPIM133_FEATURE_HARDWARE_CSN_PRESENT 1       /*!< (unspecified)                                                        */
    #define SPIM133_FEATURE_HARDWARE_DCX_PRESENT 1       /*!< (unspecified)                                                        */
    #define SPIM133_FEATURE_RXDELAY_PRESENT 1            /*!< (unspecified)                                                        */
    #define SPIM133_STALL_STATUS_PRESENT 1               /*!< (unspecified)                                                        */
    #define SPIM133_STALL_STATUS_TX_PRESENT 1            /*!< (unspecified)                                                        */
    #define SPIM133_NUM_CHIPSELECT_MIN 0                 /*!< (unspecified)                                                        */
    #define SPIM133_NUM_CHIPSELECT_MAX 0                 /*!< (unspecified)                                                        */
    #define SPIM133_NUM_CHIPSELECT_SIZE 1                /*!< (unspecified)                                                        */
    #define SPIM133_CORE_FREQUENCY 16                    /*!< Peripheral core frequency is 16 MHz.                                 */
    #define SPIM133_PRESCALER_PRESENT 1                  /*!< (unspecified)                                                        */
    #define SPIM133_PRESCALER_DIVISOR_RANGE_MIN 2        /*!< (unspecified)                                                        */
    #define SPIM133_PRESCALER_DIVISOR_RANGE_MAX 126      /*!< (unspecified)                                                        */
    #define SPIM133_PRESCALER_DIVISOR_RANGE_SIZE 127     /*!< (unspecified)                                                        */
    #define SPIM133_RXDELAY_VALUE_RANGE_MIN 0            /*!< (unspecified)                                                        */
    #define SPIM133_RXDELAY_VALUE_RANGE_MAX 7            /*!< (unspecified)                                                        */
    #define SPIM133_RXDELAY_VALUE_RANGE_SIZE 8           /*!< (unspecified)                                                        */
    #define SPIM133_RXDELAY_RESET_VALUE 2                /*!< (unspecified)                                                        */
    #define SPIM133_RXDELAY_FIELD_WIDTH_MIN 0            /*!< (unspecified)                                                        */
    #define SPIM133_RXDELAY_FIELD_WIDTH_MAX 2            /*!< (unspecified)                                                        */
    #define SPIM133_RXDELAY_FIELD_WIDTH_SIZE 3           /*!< (unspecified)                                                        */

