NordicSemiconductor/nrfx/mdk/nrf54h20_enga_interim.h
    #define SPIM134_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                  */
    #define SPIM134_MAX_DATARATE 8                       /*!< (unspecified)                                                        */
    #define SPIM134_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
    #define SPIM134_EASYDMA_MAXCNT_MAX 14                /*!< (unspecified)                                                        */
    #define SPIM134_EASYDMA_MAXCNT_SIZE 15               /*!< (unspecified)                                                        */
    #define SPIM134_FEATURE_HARDWARE_CSN_PRESENT 1       /*!< (unspecified)                                                        */
    #define SPIM134_FEATURE_HARDWARE_DCX_PRESENT 1       /*!< (unspecified)                                                        */
    #define SPIM134_FEATURE_RXDELAY_PRESENT 1            /*!< (unspecified)                                                        */
    #define SPIM134_STALL_STATUS_PRESENT 1               /*!< (unspecified)                                                        */
    #define SPIM134_STALL_STATUS_TX_PRESENT 1            /*!< (unspecified)                                                        */
    #define SPIM134_NUM_CHIPSELECT_MIN 0                 /*!< (unspecified)                                                        */
    #define SPIM134_NUM_CHIPSELECT_MAX 0                 /*!< (unspecified)                                                        */
    #define SPIM134_NUM_CHIPSELECT_SIZE 1                /*!< (unspecified)                                                        */
    #define SPIM134_CORE_FREQUENCY 16                    /*!< Peripheral core frequency is 16 MHz.                                 */
    #define SPIM134_PRESCALER_PRESENT 1                  /*!< (unspecified)                                                        */
    #define SPIM134_PRESCALER_DIVISOR_RANGE_MIN 2        /*!< (unspecified)                                                        */
    #define SPIM134_PRESCALER_DIVISOR_RANGE_MAX 126      /*!< (unspecified)                                                        */
    #define SPIM134_PRESCALER_DIVISOR_RANGE_SIZE 127     /*!< (unspecified)                                                        */
    #define SPIM134_RXDELAY_VALUE_RANGE_MIN 0            /*!< (unspecified)                                                        */
    #define SPIM134_RXDELAY_VALUE_RANGE_MAX 7            /*!< (unspecified)                                                        */
    #define SPIM134_RXDELAY_VALUE_RANGE_SIZE 8           /*!< (unspecified)                                                        */
    #define SPIM134_RXDELAY_RESET_VALUE 2                /*!< (unspecified)                                                        */
    #define SPIM134_RXDELAY_FIELD_WIDTH_MIN 0            /*!< (unspecified)                                                        */
    #define SPIM134_RXDELAY_FIELD_WIDTH_MAX 2            /*!< (unspecified)                                                        */
    #define SPIM134_RXDELAY_FIELD_WIDTH_SIZE 3           /*!< (unspecified)                                                        */

    #define SPIM135_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                  */
    #define SPIM135_MAX_DATARATE 8                       /*!< (unspecified)                                                        */
    #define SPIM135_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
    #define SPIM135_EASYDMA_MAXCNT_MAX 14                /*!< (unspecified)                                                        */
    #define SPIM135_EASYDMA_MAXCNT_SIZE 15               /*!< (unspecified)                                                        */
    #define SPIM135_FEATURE_HARDWARE_CSN_PRESENT 1       /*!< (unspecified)                                                        */
    #define SPIM135_FEATURE_HARDWARE_DCX_PRESENT 1       /*!< (unspecified)                                                        */
    #define SPIM135_FEATURE_RXDELAY_PRESENT 1            /*!< (unspecified)                                                        */
    #define SPIM135_STALL_STATUS_PRESENT 1               /*!< (unspecified)                                                        */
    #define SPIM135_STALL_STATUS_TX_PRESENT 1            /*!< (unspecified)                                                        */
    #define SPIM135_NUM_CHIPSELECT_MIN 0                 /*!< (unspecified)                                                        */
    #define SPIM135_NUM_CHIPSELECT_MAX 0                 /*!< (unspecified)                                                        */
    #define SPIM135_NUM_CHIPSELECT_SIZE 1                /*!< (unspecified)                                                        */
    #define SPIM135_CORE_FREQUENCY 16                    /*!< Peripheral core frequency is 16 MHz.                                 */
    #define SPIM135_PRESCALER_PRESENT 1                  /*!< (unspecified)                                                        */
    #define SPIM135_PRESCALER_DIVISOR_RANGE_MIN 2        /*!< (unspecified)                                                        */
    #define SPIM135_PRESCALER_DIVISOR_RANGE_MAX 126      /*!< (unspecified)                                                        */
    #define SPIM135_PRESCALER_DIVISOR_RANGE_SIZE 127     /*!< (unspecified)                                                        */
    #define SPIM135_RXDELAY_VALUE_RANGE_MIN 0            /*!< (unspecified)                                                        */
    #define SPIM135_RXDELAY_VALUE_RANGE_MAX 7            /*!< (unspecified)                                                        */
    #define SPIM135_RXDELAY_VALUE_RANGE_SIZE 8           /*!< (unspecified)                                                        */
    #define SPIM135_RXDELAY_RESET_VALUE 2                /*!< (unspecified)                                                        */
    #define SPIM135_RXDELAY_FIELD_WIDTH_MIN 0            /*!< (unspecified)                                                        */
    #define SPIM135_RXDELAY_FIELD_WIDTH_MAX 2            /*!< (unspecified)                                                        */
    #define SPIM135_RXDELAY_FIELD_WIDTH_SIZE 3           /*!< (unspecified)                                                        */

    #define SPIM136_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                  */
    #define SPIM136_MAX_DATARATE 8                       /*!< (unspecified)                                                        */
    #define SPIM136_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
    #define SPIM136_EASYDMA_MAXCNT_MAX 14                /*!< (unspecified)                                                        */
    #define SPIM136_EASYDMA_MAXCNT_SIZE 15               /*!< (unspecified)                                                        */
    #define SPIM136_FEATURE_HARDWARE_CSN_PRESENT 1       /*!< (unspecified)                                                        */
    #define SPIM136_FEATURE_HARDWARE_DCX_PRESENT 1       /*!< (unspecified)                                                        */
    #define SPIM136_FEATURE_RXDELAY_PRESENT 1            /*!< (unspecified)                                                        */
    #define SPIM136_STALL_STATUS_PRESENT 1               /*!< (unspecified)                                                        */
    #define SPIM136_STALL_STATUS_TX_PRESENT 1            /*!< (unspecified)                                                        */
    #define SPIM136_NUM_CHIPSELECT_MIN 0                 /*!< (unspecified)                                                        */
    #define SPIM136_NUM_CHIPSELECT_MAX 0                 /*!< (unspecified)                                                        */
    #define SPIM136_NUM_CHIPSELECT_SIZE 1                /*!< (unspecified)                                                        */
    #define SPIM136_CORE_FREQUENCY 16                    /*!< Peripheral core frequency is 16 MHz.                                 */
    #define SPIM136_PRESCALER_PRESENT 1                  /*!< (unspecified)                                                        */
    #define SPIM136_PRESCALER_DIVISOR_RANGE_MIN 2        /*!< (unspecified)                                                        */
    #define SPIM136_PRESCALER_DIVISOR_RANGE_MAX 126      /*!< (unspecified)                                                        */
    #define SPIM136_PRESCALER_DIVISOR_RANGE_SIZE 127     /*!< (unspecified)                                                        */
    #define SPIM136_RXDELAY_VALUE_RANGE_MIN 0            /*!< (unspecified)                                                        */
    #define SPIM136_RXDELAY_VALUE_RANGE_MAX 7            /*!< (unspecified)                                                        */
    #define SPIM136_RXDELAY_VALUE_RANGE_SIZE 8           /*!< (unspecified)                                                        */
    #define SPIM136_RXDELAY_RESET_VALUE 2                /*!< (unspecified)                                                        */
    #define SPIM136_RXDELAY_FIELD_WIDTH_MIN 0            /*!< (unspecified)                                                        */
    #define SPIM136_RXDELAY_FIELD_WIDTH_MAX 2            /*!< (unspecified)                                                        */
    #define SPIM136_RXDELAY_FIELD_WIDTH_SIZE 3           /*!< (unspecified)                                                        */

    #define SPIM137_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                  */
    #define SPIM137_MAX_DATARATE 8                       /*!< (unspecified)                                                        */
    #define SPIM137_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
    #define SPIM137_EASYDMA_MAXCNT_MAX 14                /*!< (unspecified)                                                        */
    #define SPIM137_EASYDMA_MAXCNT_SIZE 15               /*!< (unspecified)                                                        */
    #define SPIM137_FEATURE_HARDWARE_CSN_PRESENT 1       /*!< (unspecified)                                                        */
    #define SPIM137_FEATURE_HARDWARE_DCX_PRESENT 1       /*!< (unspecified)                                                        */
    #define SPIM137_FEATURE_RXDELAY_PRESENT 1            /*!< (unspecified)                                                        */
    #define SPIM137_STALL_STATUS_PRESENT 1               /*!< (unspecified)                                                        */
    #define SPIM137_STALL_STATUS_TX_PRESENT 1            /*!< (unspecified)                                                        */
    #define SPIM137_NUM_CHIPSELECT_MIN 0                 /*!< (unspecified)                                                        */
    #define SPIM137_NUM_CHIPSELECT_MAX 0                 /*!< (unspecified)                                                        */
    #define SPIM137_NUM_CHIPSELECT_SIZE 1                /*!< (unspecified)                                                        */
    #define SPIM137_CORE_FREQUENCY 16                    /*!< Peripheral core frequency is 16 MHz.                                 */
    #define SPIM137_PRESCALER_PRESENT 1                  /*!< (unspecified)                                                        */
    #define SPIM137_PRESCALER_DIVISOR_RANGE_MIN 2        /*!< (unspecified)                                                        */
    #define SPIM137_PRESCALER_DIVISOR_RANGE_MAX 126      /*!< (unspecified)                                                        */
    #define SPIM137_PRESCALER_DIVISOR_RANGE_SIZE 127     /*!< (unspecified)                                                        */
    #define SPIM137_RXDELAY_VALUE_RANGE_MIN 0            /*!< (unspecified)                                                        */
    #define SPIM137_RXDELAY_VALUE_RANGE_MAX 7            /*!< (unspecified)                                                        */
    #define SPIM137_RXDELAY_VALUE_RANGE_SIZE 8           /*!< (unspecified)                                                        */
    #define SPIM137_RXDELAY_RESET_VALUE 2                /*!< (unspecified)                                                        */
    #define SPIM137_RXDELAY_FIELD_WIDTH_MIN 0            /*!< (unspecified)                                                        */
    #define SPIM137_RXDELAY_FIELD_WIDTH_MAX 2            /*!< (unspecified)                                                        */
    #define SPIM137_RXDELAY_FIELD_WIDTH_SIZE 3           /*!< (unspecified)                                                        */


